
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-ecs/actions/runs/5786419282)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.elasticache.aws_elasticache_cluster.this
  * module.elasticache.aws_elasticache_subnet_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.elasticache.aws_elasticache_cluster.this will be created
  + resource "aws_elasticache_cluster" "this" {
      + apply_immediately          = false
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = "ap-northeast-1a"
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "dev-redis-cluster"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "6.2"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = (known after apply)
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = (known after apply)
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = [
          + "sg-09d5afa574e564b00",
        ]
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "dev-redis-subnet-group"
      + tags_all                   = {
          + "Environment" = "dev"
        }
    }

  # module.elasticache.aws_elasticache_subnet_group.this will be created
  + resource "aws_elasticache_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "dev-redis-subnet-group"
      + subnet_ids  = [
          + "subnet-02e26277c26ed7280",
          + "subnet-05d40a2db903810e4",
        ]
      + tags_all    = {
          + "Environment" = "dev"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.network.module.network.aws_eip.nat,
  on .terraform/modules/network.network/main.tf line 1030, in resource "aws_eip" "nat":
1030:   vpc = true

use domain attribute instead

(and 2 more similar warnings elsewhere)

```



<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":33,"Program":"tfcmt","SHA1":"90651b20733c7490f21fcab484000bae2cabe531","Vars":{},"WorkflowName":"dev plan"} -->